Revit 2024 API
StairsRun.Height Property
 The calculated height of the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Height { get; }
Visual Basic
Public ReadOnly Property Height As Double
	Get
Visual C++
public:
property double Height {
	double get ();
}
Remarks
 The height is the elevation span between run's base elevation and top elevation.
See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace